In [8]:
import pandas as pd

In [10]:
df=pd.read_csv(r"C:\Users\Lenovo\Documents\sheet.csv")

In [12]:
df

,ADDRES,date,time
0,"56th street,ben colony, btm layout, bangalore ...",3rd- apr- 2022,5hr 55min 8sec
1,"20th street, johns road, whitefield, bangalore...",6th-dec-2021,0hr 00min 0.280740740740741sec

In [14]:
id(df)

2479560602544

In [16]:
len(df)

2

In [18]:
df.shape

(2, 3)

In [20]:
df['ADDRES']

0    56th street,ben colony, btm layout, bangalore ...
1    20th street, johns road, whitefield, bangalore...
Name: ADDRES, dtype: object

In [22]:
df['time']

0                    5hr 55min 8sec
1    0hr 00min 0.280740740740741sec
Name: time, dtype: object

In [24]:
df['date']

0    3rd- apr- 2022
1      6th-dec-2021
Name: date, dtype: object

In [26]:
df[['ADDRES','date']]

                                              ADDRES            date
0  56th street,ben colony, btm layout, bangalore ...  3rd- apr- 2022
1  20th street, johns road, whitefield, bangalore...    6th-dec-2021

In [28]:
df[['date','time']]

             date                            time
0  3rd- apr- 2022                  5hr 55min 8sec
1    6th-dec-2021  0hr 00min 0.280740740740741sec

In [30]:
address_df=df['ADDRES'].str.split(r',',expand=True)
address_df

             0            1            2            3       4
0  56th street   ben colony   btm layout   bangalore   78909
1  20th street   johns road   whitefield   bangalore      567

In [32]:
address_df.columns=['street Name','Area','City','state','pincode']
address_df.columns

Index(['street Name', 'Area', 'City', 'state', 'pincode'], dtype='object')

In [34]:
address_df.columns=['street Name','Area','City','state','pincode']
address_df

   street Name         Area         City        state pincode
0  56th street   ben colony   btm layout   bangalore   78909
1  20th street   johns road   whitefield   bangalore      567

In [36]:
date_df=df['date'].str.split(r'-',expand=True)
date_df

     0     1      2
0  3rd   apr   2022
1  6th   dec   2021

In [38]:
date_df.columns=['date','month','year']
date_df

  date month   year
0  3rd   apr   2022
1  6th   dec   2021

In [40]:
df['time']

0                    5hr 55min 8sec
1    0hr 00min 0.280740740740741sec
Name: time, dtype: object

In [42]:
time_df=df['time'].str.split(expand=True)

In [44]:
time_df

     0      1                     2
0  5hr  55min                  8sec
1  0hr  00min  0.280740740740741sec

In [46]:
time_df.column=['hours','minutes','seconds']
time_df

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_10000\447195881.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  time_df.column=['hours','minutes','seconds']

     0      1                     2
0  5hr  55min                  8sec
1  0hr  00min  0.280740740740741sec

In [48]:
df.to_csv("cleaned_data.csv",index = False)

In [57]:
df.head(2)

,ADDRES,date,time
0,"56th street,ben colony, btm layout, bangalore ...",3rd- apr- 2022,5hr 55min 8sec
1,"20th street, johns road, whitefield, bangalore...",6th-dec-2021,0hr 00min 0.280740740740741sec